# Pandas

3rd Party ---> ETL.
Pandas is built on top on numpy.
pandas is heavily influenced by excel sheet

Row ---> Row

Column ---> Series

Collection of columns ---> Dataframe

In [1]:
import pandas as pd

In [3]:
s1 = pd.Series([10,20,30])
s2 = pd.Series([40,50,60])
print(s1)
print(s2)

df1 = pd.DataFrame({"col1":s1,"col2":s2})    # df: a collection of series.
print(df1)

0    10
1    20
2    30
dtype: int64
0    40
1    50
2    60
dtype: int64
   col1  col2
0    10    40
1    20    50
2    30    60

In [4]:
iris = pd.read_csv("https://gist.githubusercontent.com/netj/8836201/raw/6f9306ad21398ea43cba4f7d537619d0e07d5ae3/iris.csv")

In [5]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [6]:
iris.tail()

     sepal.length  sepal.width  petal.length  petal.width    variety
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

In [7]:
iris.columns

Index(['sepal.length', 'sepal.width', 'petal.length', 'petal.width',
       'variety'],
      dtype='object')

In [8]:
iris.dtypes

sepal.length    float64
sepal.width     float64
petal.length    float64
petal.width     float64
variety          object
dtype: object

In [33]:
iris.iloc[10:20,3:5]

# startRow:endRow, startColumn:endColumn

# eg: if you want rows b/w 10 and 19

    petal.width variety
10          0.2  Setosa
11          0.2  Setosa
12          0.1  Setosa
13          0.1  Setosa
14          0.2  Setosa
15          0.4  Setosa
16          0.4  Setosa
17          0.3  Setosa
18          0.3  Setosa
19          0.3  Setosa

In [17]:
# to select only 1 coln
iris['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [18]:
# to select multiple columns
iris[['sepal.length', 'petal.length']]

     sepal.length  petal.length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [34]:
# to see unique values of a coln !!!

iris['variety'].unique()

array(['Setosa', 'Versicolor', 'Virginica'], dtype=object)

In [35]:
# if you want to know the count of each unique values !!!

iris['variety'].value_counts()

variety
Setosa        50
Versicolor    50
Virginica     50
Name: count, dtype: int64

In [21]:
# if you want the grand total of a coln

iris['sepal.length'].sum()

876.5

In [22]:
# if you want the sum for multiple columns

iris[['sepal.length', 'petal.length']].sum()

sepal.length    876.5
petal.length    563.7
dtype: float64

In [24]:
# sum for all cols
iris.sum()

sepal.length                                                876.5
sepal.width                                                 458.6
petal.length                                                563.7
petal.width                                                 179.9
variety         SetosaSetosaSetosaSetosaSetosaSetosaSetosaSeto...
dtype: object

In [26]:
iris['sepal.length'].mean()

5.843333333333334

In [27]:
iris['sepal.length'].std()

0.828066127977863

In [28]:
iris['sepal.length'].mode()

0    5.0
Name: sepal.length, dtype: float64

In [29]:
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [30]:
iris.head()

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa
3           4.6          3.1           1.5          0.2  Setosa
4           5.0          3.6           1.4          0.2  Setosa

In [31]:
# we can also put conditions

iris[iris['sepal.length']>5.2]

     sepal.length  sepal.width  petal.length  petal.width    variety
5             5.4          3.9           1.7          0.4     Setosa
10            5.4          3.7           1.5          0.2     Setosa
14            5.8          4.0           1.2          0.2     Setosa
15            5.7          4.4           1.5          0.4     Setosa
16            5.4          3.9           1.3          0.4     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[105 rows x 5 columns]

In [32]:
# we can also add more than one condition

iris[(iris['sepal.length']> 5.2) & (iris['sepal.width']>3.5)]

     sepal.length  sepal.width  petal.length  petal.width    variety
5             5.4          3.9           1.7          0.4     Setosa
10            5.4          3.7           1.5          0.2     Setosa
14            5.8          4.0           1.2          0.2     Setosa
15            5.7          4.4           1.5          0.4     Setosa
16            5.4          3.9           1.3          0.4     Setosa
18            5.7          3.8           1.7          0.3     Setosa
33            5.5          4.2           1.4          0.2     Setosa
48            5.3          3.7           1.5          0.2     Setosa
109           7.2          3.6           6.1          2.5  Virginica
117           7.7          3.8           6.7          2.2  Virginica
131           7.9          3.8           6.4          2.0  Virginica

#### Using pandas you can export the data to multiple formats

In [36]:
!pip install fsspec

Collecting fsspec
  Downloading fsspec-2024.9.0-py3-none-any.whl (179 kB)
                                              0.0/179.3 kB ? eta -:--:--
     ------                                   30.7/179.3 kB ? eta -:--:--
     -----------------------                112.6/179.3 kB 1.6 MB/s eta 0:00:01
     ------------------------------------   174.1/179.3 kB 1.7 MB/s eta 0:00:01
     -------------------------------------- 179.3/179.3 kB 1.6 MB/s eta 0:00:00
Installing collected packages: fsspec
Successfully installed fsspec-2024.9.0

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [39]:
iris.to_csv('C://code//iris.csv')

In [40]:
iris.to_csv('C://code//iris.csv', index=False)

In [43]:
iris.to_json('C://code//iris.json')

In [44]:
iris.to_excel('C://code//iris.xlsx')

In [45]:
#### from other formats to csv

In [47]:
todos = pd.read_json("https://jsonplaceholder.typicode.com/todos")

In [48]:
todos.to_csv("C://code//todos.csv",index=False)

Pandas is usead a lot in data science and automation

In [49]:
todos.head()

   userId  id                                              title  completed
0       1   1                                 delectus aut autem      False
1       1   2                 quis ut nam facilis et officia qui      False
2       1   3                                fugiat veniam minus      False
3       1   4                                   et porro tempora       True
4       1   5  laboriosam mollitia et enim quasi adipisci qui...      False

In [52]:
todos['todoId'] = todos['id']*3

In [53]:
todos.head()

,userId,id,title,completed,todoId
0,1,1,delectus aut autem,False,3
1,1,2,quis ut nam facilis et officia qui,False,6
2,1,3,fugiat veniam minus,False,9
3,1,4,et porro tempora,True,12
4,1,5,laboriosam mollitia et enim quasi adipisci qui...,False,15

In [54]:
todos.columns = todos.columns.str.upper()

In [55]:
todos.head()

,USERID,ID,TITLE,COMPLETED,TODOID
0,1,1,delectus aut autem,False,3
1,1,2,quis ut nam facilis et officia qui,False,6
2,1,3,fugiat veniam minus,False,9
3,1,4,et porro tempora,True,12
4,1,5,laboriosam mollitia et enim quasi adipisci qui...,False,15

In [56]:
todos.columns = todos.columns.str.lower()

In [60]:
todos.head()

   userid  id                                              title  completed
0       1   1                                 delectus aut autem      False
1       1   2                 quis ut nam facilis et officia qui      False
2       1   3                                fugiat veniam minus      False
3       1   4                                   et porro tempora       True
4       1   5  laboriosam mollitia et enim quasi adipisci qui...      False

In [57]:
#### to drop a col

it creates a new df and then drops. to avoid this use inplace = True

In [58]:
todos.drop('todoid', axis=1, inplace=True)

In [59]:
todos.head()

   userid  id                                              title  completed
0       1   1                                 delectus aut autem      False
1       1   2                 quis ut nam facilis et officia qui      False
2       1   3                                fugiat veniam minus      False
3       1   4                                   et porro tempora       True
4       1   5  laboriosam mollitia et enim quasi adipisci qui...      False

#### Group by

In [64]:
# group by data

grouped = iris.groupby('variety')

In [66]:
grouped.head()

     sepal.length  sepal.width  petal.length  petal.width     variety
0             5.1          3.5           1.4          0.2      Setosa
1             4.9          3.0           1.4          0.2      Setosa
2             4.7          3.2           1.3          0.2      Setosa
3             4.6          3.1           1.5          0.2      Setosa
4             5.0          3.6           1.4          0.2      Setosa
50            7.0          3.2           4.7          1.4  Versicolor
51            6.4          3.2           4.5          1.5  Versicolor
52            6.9          3.1           4.9          1.5  Versicolor
53            5.5          2.3           4.0          1.3  Versicolor
54            6.5          2.8           4.6          1.5  Versicolor
100           6.3          3.3           6.0          2.5   Virginica
101           5.8          2.7           5.1          1.9   Virginica
102           7.1          3.0           5.9          2.1   Virginica
103           6.3          2.9           5.6          1.8   Virginica
104           6.5          3.0           5.8          2.2   Virginica

In [65]:
grouped.agg({'petal.length':["min","max","mean","sum"],"sepal.length":["min","max"]})

           petal.length                    sepal.length
                    min  max   mean    sum          min  max
variety
Setosa              1.0  1.9  1.462   73.1          4.3  5.8
Versicolor          3.0  5.1  4.260  213.0          4.9  7.0
Virginica           4.5  6.9  5.552  277.6          4.9  7.9

In [67]:
ipl=pd.read_csv("https://raw.githubusercontent.com/12345k/IPL-Dataset/refs/heads/master/IPL/data.csv")

In [69]:
ipl.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2008,Bangalore,2008-04-18,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Kolkata Knight Riders,140,0,BB McCullum,M Chinnaswamy Stadium,Asad Rauf,RE Koertzen,NaN
1,2,2008,Chandigarh,2008-04-19,Chennai Super Kings,Kings XI Punjab,Chennai Super Kings,bat,normal,0,Chennai Super Kings,33,0,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",MR Benson,SL Shastri,NaN
2,3,2008,Delhi,2008-04-19,Rajasthan Royals,Delhi Daredevils,Rajasthan Royals,bat,normal,0,Delhi Daredevils,0,9,MF Maharoof,Feroz Shah Kotla,Aleem Dar,GA Pratapkumar,NaN
3,4,2008,Mumbai,2008-04-20,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,normal,0,Royal Challengers Bangalore,0,5,MV Boucher,Wankhede Stadium,SJ Davis,DJ Harper,NaN
4,5,2008,Kolkata,2008-04-20,Deccan Chargers,Kolkata Knight Riders,Deccan Chargers,bat,normal,0,Kolkata Knight Riders,0,5,DJ Hussey,Eden Gardens,BF Bowden,K Hariharan,NaN

In [68]:
grouped=ipl.groupby(['season','winner'])

In [70]:
grouped.head()

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2008,Bangalore,2008-04-18,Kolkata Knight Riders,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Kolkata Knight Riders,140,0,BB McCullum,M Chinnaswamy Stadium,Asad Rauf,RE Koertzen,NaN
1,2,2008,Chandigarh,2008-04-19,Chennai Super Kings,Kings XI Punjab,Chennai Super Kings,bat,normal,0,Chennai Super Kings,33,0,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",MR Benson,SL Shastri,NaN
2,3,2008,Delhi,2008-04-19,Rajasthan Royals,Delhi Daredevils,Rajasthan Royals,bat,normal,0,Delhi Daredevils,0,9,MF Maharoof,Feroz Shah Kotla,Aleem Dar,GA Pratapkumar,NaN
3,4,2008,Mumbai,2008-04-20,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,normal,0,Royal Challengers Bangalore,0,5,MV Boucher,Wankhede Stadium,SJ Davis,DJ Harper,NaN
4,5,2008,Kolkata,2008-04-20,Deccan Chargers,Kolkata Knight Riders,Deccan Chargers,bat,normal,0,Kolkata Knight Riders,0,5,DJ Hussey,Eden Gardens,BF Bowden,K Hariharan,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
555,556,2016,Chandigarh,2016-05-09,Royal Challengers Bangalore,Kings XI Punjab,Kings XI Punjab,field,normal,0,Royal Challengers Bangalore,1,0,SR Watson,"Punjab Cricket Association IS Bindra Stadium, ...",AK Chaudhary,HDPK Dharmasena,NaN
559,560,2016,Visakhapatnam,2016-05-13,Mumbai Indians,Kings XI Punjab,Mumbai Indians,bat,normal,0,Kings XI Punjab,0,7,MP Stoinis,Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket St...,HDPK Dharmasena,CK Nandan,NaN
560,561,2016,Bangalore,2016-05-14,Royal Challengers Bangalore,Gujarat Lions,Gujarat Lions,field,normal,0,Royal Challengers Bangalore,144,0,AB de Villiers,M Chinnaswamy Stadium,AY Dandekar,VK Sharma,NaN
565,566,2016,Visakhapatnam,2016-05-17,Delhi Daredevils,Rising Pune Supergiants,Rising Pune Supergiants,field,normal,1,Rising Pune Supergiants,19,0,AB Dinda,Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket St...,Nitin Menon,C Shamshuddin,NaN
569,570,2016,Visakhapatnam,2016-05-21,Kings XI Punjab,Rising Pune Supergiants,Kings XI Punjab,bat,normal,0,Rising Pune Supergiants,0,4,MS Dhoni,Dr. Y.S. Rajasekhara Reddy ACA-VDCA Cricket St...,HDPK Dharmasena,Nitin Menon,NaN

In [71]:
grouped.agg({'city':'count'})

                                    city
season winner
2008   Chennai Super Kings             9
       Deccan Chargers                 2
       Delhi Daredevils                7
       Kings XI Punjab                10
       Kolkata Knight Riders           6
...                                  ...
2016   Kolkata Knight Riders           8
       Mumbai Indians                  7
       Rising Pune Supergiants         5
       Royal Challengers Bangalore     9
       Sunrisers Hyderabad            11

[76 rows x 1 columns]

#### Merge

In [77]:
student = pd.DataFrame({"rollNo": [1,2,3,4], "sname":["Roln", "Sam", "Bill", "Bob"], "deptId": [1,1,2,None]})

In [78]:
department = pd.DataFrame({"dept_id": [1,2,3,4], "deptname":["IT", "COMP", "EXTC", "Bio"]})

In [79]:
student

   rollNo sname  deptId
0       1  Roln     1.0
1       2   Sam     1.0
2       3  Bill     2.0
3       4   Bob     NaN

In [80]:
department

   dept_id deptname
0        1       IT
1        2     COMP
2        3     EXTC
3        4      Bio

In [92]:
# to merge both the above

# inner means wherever both the data matches, only those will be added
stu_dep1 = pd.merge(student, department, left_on='deptId', right_on='dept_id', how='inner')
stu_dep1.head()

   rollNo sname  deptId  dept_id deptname
0       1  Roln     1.0        1       IT
1       2   Sam     1.0        1       IT
2       3  Bill     2.0        2     COMP

In [94]:
# left: everything from student table and only matching data from right table

stu_dep2 = pd.merge(student, department, left_on='deptId', right_on='dept_id', how='left')
stu_dep2.head()

   rollNo sname  deptId  dept_id deptname
0       1  Roln     1.0      1.0       IT
1       2   Sam     1.0      1.0       IT
2       3  Bill     2.0      2.0     COMP
3       4   Bob     NaN      NaN      NaN

In [101]:
# right: everything from dept table will come and only matching from left table

stu_dep3 = pd.merge(student, department, left_on='deptId', right_on='dept_id', how='right')
print(stu_dep3)

   rollNo sname  deptId  dept_id deptname
0     1.0  Roln     1.0        1       IT
1     2.0   Sam     1.0        1       IT
2     3.0  Bill     2.0        2     COMP
3     NaN   NaN     NaN        3     EXTC
4     NaN   NaN     NaN        4      Bio

In [100]:
# outer: everything from both table will come

stu_dep4= pd.merge(student,department,left_on='deptId',right_on='dept_id',how='outer')
print(stu_dep4)

   rollNo sname  deptId  dept_id deptname
0     1.0  Roln     1.0      1.0       IT
1     2.0   Sam     1.0      1.0       IT
2     3.0  Bill     2.0      2.0     COMP
3     4.0   Bob     NaN      NaN      NaN
4     NaN   NaN     NaN      3.0     EXTC
5     NaN   NaN     NaN      4.0      Bio

In [99]:
# you can also export the result of merge. 

stu_dep4.to_csv("C://code//stu_dep.csv", index=False)

#### append 2 dataframes

In [115]:
# to concatenate the columsn

res=pd.concat([stu_dep3,stu_dep4],ignore_index=True)
print(res)

    rollNo sname  deptId  dept_id deptname
0      1.0  Roln     1.0      1.0       IT
1      2.0   Sam     1.0      1.0       IT
2      3.0  Bill     2.0      2.0     COMP
3      NaN   NaN     NaN      3.0     EXTC
4      NaN   NaN     NaN      4.0      Bio
5      1.0  Roln     1.0      1.0       IT
6      2.0   Sam     1.0      1.0       IT
7      3.0  Bill     2.0      2.0     COMP
8      4.0   Bob     NaN      NaN      NaN
9      NaN   NaN     NaN      3.0     EXTC
10     NaN   NaN     NaN      4.0      Bio

In [108]:
# to concatenate the rows

res1=pd.concat([stu_dep3,stu_dep4],axis=1)
print(res1)

   rollNo sname  deptId  dept_id deptname  rollNo sname  deptId  dept_id  \
0     1.0  Roln     1.0      1.0       IT     1.0  Roln     1.0      1.0
1     2.0   Sam     1.0      1.0       IT     2.0   Sam     1.0      1.0
2     3.0  Bill     2.0      2.0     COMP     3.0  Bill     2.0      2.0
3     NaN   NaN     NaN      3.0     EXTC     4.0   Bob     NaN      NaN
4     NaN   NaN     NaN      4.0      Bio     NaN   NaN     NaN      3.0
5     NaN   NaN     NaN      NaN      NaN     NaN   NaN     NaN      4.0

  deptname
0       IT
1       IT
2     COMP
3      NaN
4     EXTC
5      Bio

above has too many nan. To drop all these records..

In [109]:
res1.dropna()

,rollNo,sname,deptId,dept_id,deptname,rollNo,sname,deptId,dept_id,deptname
0,1.0,Roln,1.0,1.0,IT,1.0,Roln,1.0,1.0,IT
1,2.0,Sam,1.0,1.0,IT,2.0,Sam,1.0,1.0,IT
2,3.0,Bill,2.0,2.0,COMP,3.0,Bill,2.0,2.0,COMP

In [111]:
# we can also fill nan !

res1.fillna(3)   # this will create a new df. if you want on the same df, u can use inplae=...

,rollNo,sname,deptId,dept_id,deptname,rollNo,sname,deptId,dept_id,deptname
0,1.0,Roln,1.0,1.0,IT,1.0,Roln,1.0,1.0,IT
1,2.0,Sam,1.0,1.0,IT,2.0,Sam,1.0,1.0,IT
2,3.0,Bill,2.0,2.0,COMP,3.0,Bill,2.0,2.0,COMP
3,3.0,3,3.0,3.0,EXTC,4.0,Bob,3.0,3.0,3
4,3.0,3,3.0,4.0,Bio,3.0,3,3.0,3.0,EXTC
5,3.0,3,3.0,3.0,3,3.0,3,3.0,4.0,Bio

In [114]:
# to fillna only on particular column

res1['sname'].fillna(3)

  sname sname
0  Roln  Roln
1   Sam   Sam
2  Bill  Bill
3     3   Bob
4     3     3
5     3     3

In [ ]:
res1['sname'].str.replace('R', 'r'

In [116]:
print(iris['variety'])

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: variety, Length: 150, dtype: object

In [117]:
iris['variety'].str.replace('', '')

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: variety, Length: 150, dtype: object

# Database

In [118]:
!pip install mysql-connector-python

Collecting mysql-connector-python

[notice] A new release of pip is available: 23.1.2 -> 24.2
[notice] To update, run: python.exe -m pip install --upgrade pip

  Downloading mysql_connector_python-9.0.0-cp311-cp311-win_amd64.whl (14.3 MB)
                                              0.0/14.3 MB ? eta -:--:--
                                              0.0/14.3 MB 1.4 MB/s eta 0:00:11
                                             0.1/14.3 MB 825.8 kB/s eta 0:00:18
                                              0.1/14.3 MB 1.3 MB/s eta 0:00:11
                                              0.3/14.3 MB 2.0 MB/s eta 0:00:08
     -                                        0.4/14.3 MB 2.1 MB/s eta 0:00:07
     -                                        0.6/14.3 MB 3.0 MB/s eta 0:00:05
     ---                                      1.1/14.3 MB 4.4 MB/s eta 0:00:04
     ---                                      1.4/14.3 MB 4.6 MB/s eta 0:00:03
     ------                                   2.3/14.3 MB 7.5 MB/s eta 0:00:02
     ----------                               3.7/14.3 MB 10.4 MB/s eta 0:00:02
     --------------                           5.3/14.3 MB 13.1 MB/s eta 0:00:01
     --------------------------               9.5/14.3 MB 21.7 MB/s eta 0:00:01
     ------------------------------------    13.5/14.3 MB 93.0 MB/s eta 0:00:01
     --------------------------------------  14.3/14.3 MB 93.9 MB/s eta 0:00:01
     --------------------------------------  14.3/14.3 MB 93.9 MB/s eta 0:00:01
     --------------------------------------- 14.3/14.3 MB 50.4 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.0.0

In [120]:
import mysql.connector
connection = mysql.connector.connect(host="localhost", user="root", password="password", database="bnp")

In [121]:
cursor = connection.cursor()  # using this cursor you can fire queries

In [122]:
insertSql = 'insert into students(name, age, address) values (%s, %s, %s)'
values = ("Roland", 22, "Mumbai")
cursor.execute(insertSql, values)
connection.commit()
print(cursor.rowcount, "rows inserted")

1 rows inserted

In [124]:
# to insert many rows in one go

insertSql = 'insert into students(name, age, address) values (%s, %s, %s)'        
values = [("Roland", 22, "Mumbai"), ("Sam", 40, "Delhi")]
cursor.executemany(insertSql, values)       # this line has been changed
connection.commit()
print(cursor.rowcount, "rows inserted")

2 rows inserted

In [125]:
cursor.execute("select * from students")
res = cursor.fetchall()
for d in res: 
    print(d)

('Roland', 22, 'Mumbai')
('Roland', 22, 'Mumbai')
('Sam', 40, 'Delhi')

In [126]:
# the issue here is that you are not getting the coln name. so you can add dictionary to the cursor:

cursor = connection.cursor(dictionary=True)  #
cursor.execute("select * from students", )
res = cursor.fetchall()
for d in res: 
    print(d)

{'name': 'Roland', 'age': 22, 'address': 'Mumbai'}
{'name': 'Roland', 'age': 22, 'address': 'Mumbai'}
{'name': 'Sam', 'age': 40, 'address': 'Delhi'}

assignment: read from this db and store it in csv

In [127]:
print(res)

[{'name': 'Roland', 'age': 22, 'address': 'Mumbai'}, {'name': 'Roland', 'age': 22, 'address': 'Mumbai'}, {'name': 'Sam', 'age': 40, 'address': 'Delhi'}]

In [130]:
df = pd.DataFrame(res)
df.to_csv('C://code/db.csv', index=False)

In [132]:
# or you can convert it like this:

In [134]:
import mysql.connector

connection=mysql.connector.connect(host="localhost",user="root",password="password",database="bnp")

cursor=connection.cursor(dictionary=True)

cursor.execute("select * from students")

dataLst=[]

res = cursor.fetchall()

for d in res:

    dataLst.append(d)

In [135]:
import csv

with open("C://code//studentsdb.csv","w",newline='') as op:

    dictWriter=csv.DictWriter(op,fieldnames=["name","age","address"])

    dictWriter.writeheader()

    dictWriter.writerows(dataLst)

In [136]:
# or you can do it like this

In [ ]:
# u can store the date using pandas and you can even retrieve the data using pandas

In [137]:
import sqlalchemy

conn = sqlalchemy.create_engine("mysql+mysqlconnector://root:password@localhost:3306/bnp")

iris.to_sql(name="iris",con=conn,if_exists='replace',index=False)

150

now you can go to mysql commandline and view it using select * command

In [138]:
studentdf =pd.read_sql("select * from students",con=conn)

In [139]:
studentdf

     name  age address
0  Roland   22  Mumbai
1  Roland   22  Mumbai
2     Sam   40   Delhi

In [145]:
# similarly inserting todos data

conn = sqlalchemy.create_engine("mysql+mysqlconnector://root:password@localhost:3306/bnp")

todos.to_sql(name="todos",con=conn,if_exists='replace',index=False)

200

In [146]:
print(todos)

     userid   id                                              title  completed
0         1    1                                 delectus aut autem      False
1         1    2                 quis ut nam facilis et officia qui      False
2         1    3                                fugiat veniam minus      False
3         1    4                                   et porro tempora       True
4         1    5  laboriosam mollitia et enim quasi adipisci qui...      False
..      ...  ...                                                ...        ...
195      10  196                consequuntur aut ut fugit similique       True
196      10  197                  dignissimos quo nobis earum saepe       True
197      10  198                       quis eius est sint explicabo       True
198      10  199                       numquam repellendus a magnam       True
199      10  200                       ipsam aperiam voluptates qui      False

[200 rows x 4 columns]

create em p name add fileds id, name, salary and insert data into it

In [147]:
cursor = connection.cursor()  # using this cursor you can fire queries

In [150]:
insertSql = 'insert into emp(id, name, salary) values (%s, %s, %s)'
values = (1, "Sam", 900000)
cursor.execute(insertSql, values)
connection.commit()
print(cursor.rowcount, "rows inserted")

1 rows inserted

In [156]:
id = [2, 3, 4]
names = ["Bill", "Andrew", "Chris"]
salary = [ 20000, 30000, 40000]

emp_records = pd.DataFrame({"id":id,"name": names, "salary" : salary})

In [157]:
print(emp_records)

   id    name  salary
0   2    Bill   20000
1   3  Andrew   30000
2   4   Chris   40000

In [158]:
# insert to sql table using alchemy

conn = sqlalchemy.create_engine("mysql+mysqlconnector://root:password@localhost:3306/bnp")
emp_records.to_sql(name="emp",con=conn,if_exists='replace',index=False)

3